# Pandas Foundations 1

<font size="3"> 

- Quick recap
- Jupyter Server
- Subsetting 
- Introduction to Pandas (1)
  - Grammatical verbs
- Q&A
    
    
</font>

## Dictionaries

- A dictionary is a collection of items
- Each item of a dictionary has a key/value pair
- Dictionaries are used to store data values
- As of Python version 3.7, dictionaries are ordered. In previous versios, dictionaries are unordered.

In [1]:
pop = [30.55, 2.77, 39.21]

countries = ["afghanistan", "albania", "algeria"]

In [3]:
type(countries)

list

In [6]:
# -- A dictionary is a collection which is ordered*, changeable and does not allow duplicates.

world = {"afghanistan":30.55, "albania":2.77, "algeria":39.21}

world

{'afghanistan': 30.55, 'albania': 2.77, 'algeria': 39.21}

In [7]:
type(world)

dict

In [8]:
world["albania"]

2.77

### Access dictionary

If the keys of a dictionary are chosen wisely, accessing the values in a dictionary is easy and intuitive. For example, to get the capital for France from europe you can use:

europe['france']

Here, 'france' is the key and 'paris' the value is returned.

In [9]:
# Definition of dictionary
europe = {'spain':'madrid', 'france':'paris', 'germany':'berlin', 'norway':'oslo' }

# Print out the keys in europe
print(europe.keys())

dict_keys(['spain', 'france', 'germany', 'norway'])

In [11]:
# Print out value that belongs to key 'norway'
print(europe['norway'])

oslo

### Dictionary Manipulation (1)

- Add

If you know how to access a dictionary, you can also assign a new value to it. To add a new key-value pair to europe you can use something like this:

europe['iceland'] = 'reykjavik'

In [12]:
# Definition of dictionary
europe = {'spain':'madrid', 'france':'paris', 'germany':'berlin', 'norway':'oslo' }

europe

{'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo'}

In [13]:
# Add italy to europe
europe['italy'] = 'rome'

In [14]:
# Print out italy in europe
print('italy' in europe)

True

In [17]:
# Add poland to europe
europe['poland'] = 'warsaw'

In [18]:
# Print europe
print(europe)

{'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo', 'italy': 'rome', 'poland': 'warsaw'}

### Dictionary Manipulation (2)

- Upate
- Delete

In [19]:
# Definition of dictionary
europe = {'spain':'madrid', 'france':'paris', 'germany':'bonn',
          'norway':'oslo', 'italy':'rome', 'poland':'warsaw',
          'australia':'vienna' }

print(europe)

{'spain': 'madrid', 'france': 'paris', 'germany': 'bonn', 'norway': 'oslo', 'italy': 'rome', 'poland': 'warsaw', 'australia': 'vienna'}

In [20]:
# Update capital of germany
europe['germany'] = 'berlin'

europe

{'spain': 'madrid',
 'france': 'paris',
 'germany': 'berlin',
 'norway': 'oslo',
 'italy': 'rome',
 'poland': 'warsaw',
 'australia': 'vienna'}

In [21]:
# Remove australia
del(europe['australia'])

In [22]:
# Print europe
print(europe)

{'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo', 'italy': 'rome', 'poland': 'warsaw'}

### Dictionary Manipulation (3)

- Dictionaries can contain key:value pairs where the values are again dictionaries.

As an example, have a look at the script where another version of europe - the dictionary you've been working with all along - is coded. The keys are still the country names, but the values are dictionaries that contain more information than just the capital.

It's perfectly possible to chain square brackets to select elements. To fetch the population for Spain from europe, for example, you need:

europe['spain']['population']

In [23]:
# Dictionary of dictionaries
europe = { 'spain': { 'capital':'madrid', 'population':46.77 },
           'france': { 'capital':'paris', 'population':66.03 },
           'germany': { 'capital':'berlin', 'population':80.62 },
           'norway': { 'capital':'oslo', 'population':5.084 } }


europe

{'spain': {'capital': 'madrid', 'population': 46.77},
 'france': {'capital': 'paris', 'population': 66.03},
 'germany': {'capital': 'berlin', 'population': 80.62},
 'norway': {'capital': 'oslo', 'population': 5.084}}

In [24]:
# Print out the capital of France
print(europe['france']['capital'])

paris

In [25]:
# Create sub-dictionary data
data = { 'capital':'rome', 'population':59.83 }

data

{'capital': 'rome', 'population': 59.83}

In [26]:
# Add data to europe under key 'italy'
europe['italy'] = data

In [28]:
# Print europe
europe

{'spain': {'capital': 'madrid', 'population': 46.77},
 'france': {'capital': 'paris', 'population': 66.03},
 'germany': {'capital': 'berlin', 'population': 80.62},
 'norway': {'capital': 'oslo', 'population': 5.084},
 'italy': {'capital': 'rome', 'population': 59.83}}

## Pandas

What is pandas?

- Python library for data analysis
    - <https://pandas.pydata.org/getting_started.html>
    - <https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf>
    
- Built on Numpy

- DataFrame
    - Tidy data 
    - <https://www.jstatsoft.org/article/view/v059i10>

- High-performance containers for data analysis

- Data structures with a lot of functionality
 - Meaningful labels
 - Time series functionality
 - Handling missing data
 - Relational operations

### Dictionary to DataFrame (1)

In [29]:
# Pre-defined lists
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

type(cpc)

list

In [30]:
# Create dictionary my_dict with three key:value pairs: my_dict
my_dict = { 'country':names, 'drives_right':dr, 'cars_per_cap':cpc }

type(my_dict)

dict

In [32]:
# Import pandas as pd
import pandas as pd

# Build a DataFrame cars from my_dict: cars
cars = pd.DataFrame(my_dict)

# Print cars
print(cars)
type(cars)

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

pandas.core.frame.DataFrame

### Dataframe

![title](imgs/dataframe.png)

### CSV to DataFrame (1)

- Putting data in a dictionary and then building a DataFrame works, but it's not very efficient. What if you're dealing with millions of observations? In those cases, the data is typically available as files with a regular structure. 

- One of those file types is the CSV file, which is short for "comma-separated values".

- To import CSV data into Python as a Pandas DataFrame you can use read_csv().

In [37]:
# --Import pandas as pd
#import pandas as pd

# Import the cars.csv data: cars
cars = pd.read_csv('data/cars.csv')

# Print out cars
print(cars)

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

### CSV to DataFrame (2)

- Your read_csv() call to import the CSV data didn't generate an error, but the output is not entirely what we wanted. 

- The row labels were imported as another column without a name.

In [38]:
# Fix import by including index_col
cars = pd.read_csv('data/cars.csv', index_col = 0)

# Print out cars
print(cars)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

### Square Brackets (1)

- To select only the cars_per_cap column from cars, you can use:

- The single bracket version gives a Pandas Series, the double bracket version gives a Pandas DataFrame.

    - cars['cars_per_cap']
        - <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html>

    - cars[['cars_per_cap']]
        - <https://pandas.pydata.org/pandas-docs/stable/reference/frame.html>

In [40]:
# Print out country column as Pandas Series
print(cars['country'])

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [41]:
type(cars['country'])

pandas.core.series.Series

In [43]:
# Print out country column as Pandas DataFrame
print(cars[['country']])

           country
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

In [44]:
type(cars[['country']])

pandas.core.frame.DataFrame

In [45]:
# Print out DataFrame with country and drives_right columns
print(cars[['country', 'drives_right']])

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

### Square Brackets (2)

- Square brackets can do more than just selecting columns. You can also use them to get rows, or observations, from a DataFrame. 

- The following call selects the first five rows from the cars DataFrame:

    - cars[0:5]

- The result is another DataFrame containing only the rows you specified.

In [46]:
# Print out first 3 observations
print(cars[0:3])

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False

In [47]:
# Print out fourth, fifth and sixth observation
print(cars[3:6])

     cars_per_cap  country  drives_right
IN             18    India         False
RU            200   Russia          True
MOR            70  Morocco          True

### loc and iloc (1)

- With loc and iloc you can do practically any data selection operation on DataFrames you can think of. 

- **loc** is label-based, which means that you have to specify rows and columns based on their row and column labels. 

    - <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html>

- **iloc** is integer index based, so you have to specify rows and columns by their integer index like you did in the previous exercise.

    - <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html>


cars.loc['RU']   
cars.iloc[4]   

cars.loc[['RU']]   
cars.iloc[[4]]   

cars.loc[['RU', 'AUS']]   
cars.iloc[[4, 1]]

In [48]:
#import pandas as pd

cars = pd.read_csv('data/cars.csv', index_col = 0)

cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [49]:
# Print out observations for Australia and Egypt
print(cars.loc[['AUS', 'EG']])

     cars_per_cap    country  drives_right
AUS           731  Australia         False
EG             45      Egypt          True

In [50]:
# Print out observation for Japan
print(cars.iloc[2])

cars_per_cap      588
country         Japan
drives_right    False
Name: JAP, dtype: object

### loc and iloc (2)

- loc and iloc also allow you to select both rows and columns from a DataFrame.

In [51]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [52]:
cars.loc['IN', 'cars_per_cap']

18

In [53]:
cars.iloc[3, 0]

18

In [54]:
cars.loc[['IN', 'RU'], 'cars_per_cap']

IN     18
RU    200
Name: cars_per_cap, dtype: int64

In [55]:
cars.iloc[[3, 4], 0]

IN     18
RU    200
Name: cars_per_cap, dtype: int64

In [56]:
cars.loc[['IN', 'RU'], ['cars_per_cap', 'country']]

    cars_per_cap country
IN            18   India
RU           200  Russia

In [57]:
cars.iloc[[3, 4], [0, 1]]

    cars_per_cap country
IN            18   India
RU           200  Russia

### loc and iloc (3)

- It's also possible to select only columns with loc and iloc. 

- In both cases, you simply put a slice going from beginning to end in front of the comma:

In [58]:
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [59]:
cars.loc[:, 'country']

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [60]:
cars.iloc[:, 1]

US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [61]:
cars.loc[:, ['country','drives_right']]

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

In [62]:
cars.iloc[:, [1, 2]]

           country  drives_right
US   United States          True
AUS      Australia         False
JAP          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

### Methods

- head()
- tail()
- info()

In [63]:
apple_stock = pd.read_csv("data/appl_1980_2014.csv")

In [71]:
apple_stock.head()

         Date   Open   High    Low  Close    Volume  Adj Close
0  2014-07-08  96.27  96.80  93.92  95.35  65130000      95.35
1  2014-07-07  94.14  95.99  94.10  95.97  56305400      95.97
2  2014-07-03  93.67  94.10  93.20  94.03  22891800      94.03
3  2014-07-02  93.87  94.06  93.09  93.48  28420900      93.48
4  2014-07-01  93.52  94.07  93.13  93.52  38170200      93.52

In [72]:
apple_stock.tail()

            Date   Open   High    Low  Close     Volume  Adj Close
8460  1980-12-18  26.63  26.75  26.63  26.63   18362400       0.41
8461  1980-12-17  25.87  26.00  25.87  25.87   21610400       0.40
8462  1980-12-16  25.37  25.37  25.25  25.25   26432000       0.39
8463  1980-12-15  27.38  27.38  27.25  27.25   43971200       0.42
8464  1980-12-12  28.75  28.87  28.75  28.75  117258400       0.45

In [74]:
apple_stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8465 entries, 0 to 8464
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       8465 non-null   object
 1   Open       8465 non-null   float64
 2   High       8465 non-null   float64
 3   Low        8465 non-null   float64
 4   Close      8465 non-null   float64
 5   Volume     8465 non-null   int64
 6   Adj Close  8465 non-null   float64
dtypes: float64(5), int64(1), object(1)
memory usage: 463.1+ KB

### Datasets from CSV files

- CSV file has no column headers

- Missing values

- <http://www.sidc.be/silso/home>

In [75]:
filepath = 'data/ISSN_D_tot.csv'

In [76]:
sunspots = pd.read_csv(filepath)

#sunspots = pd.read_csv("data/ISSN_D_tot.csv")

sunspots

       1818  01  01.1  1818.004   -1  1
0      1818   1     2  1818.007   -1  1
1      1818   1     3  1818.010   -1  1
2      1818   1     4  1818.012   -1  1
3      1818   1     5  1818.015   -1  1
4      1818   1     6  1818.018   -1  1
...     ...  ..   ...       ...  ... ..
71855  2014   9    26  2014.735  111  0
71856  2014   9    27  2014.738  122  0
71857  2014   9    28  2014.741  130  0
71858  2014   9    29  2014.743  121  0
71859  2014   9    30  2014.746  120  0

[71860 rows x 6 columns]

In [77]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71860 entries, 0 to 71859
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   1818      71860 non-null  int64
 1   01        71860 non-null  int64
 2   01.1      71860 non-null  int64
 3   1818.004  71860 non-null  float64
 4    -1       71860 non-null  int64
 5   1         71860 non-null  int64
dtypes: float64(1), int64(5)
memory usage: 3.3 MB

In [78]:
sunspots.iloc[10:20, :]

    1818  01  01.1  1818.004   -1  1
10  1818   1    12  1818.034   -1  1
11  1818   1    13  1818.037   22  1
12  1818   1    14  1818.040   -1  1
13  1818   1    15  1818.042   -1  1
14  1818   1    16  1818.045   -1  1
15  1818   1    17  1818.048   46  1
16  1818   1    18  1818.051   59  1
17  1818   1    19  1818.053   63  1
18  1818   1    20  1818.056   -1  1
19  1818   1    21  1818.059   -1  1

### Using header keyword

In [79]:
sunspots = pd.read_csv(filepath, header=None)

sunspots

          0  1   2         3    4  5
0      1818  1   1  1818.004   -1  1
1      1818  1   2  1818.007   -1  1
2      1818  1   3  1818.010   -1  1
3      1818  1   4  1818.012   -1  1
4      1818  1   5  1818.015   -1  1
...     ... ..  ..       ...  ... ..
71856  2014  9  26  2014.735  111  0
71857  2014  9  27  2014.738  122  0
71858  2014  9  28  2014.741  130  0
71859  2014  9  29  2014.743  121  0
71860  2014  9  30  2014.746  120  0

[71861 rows x 6 columns]

In [80]:
sunspots.iloc[10:20, :]

       0  1   2         3   4  5
10  1818  1  11  1818.031  -1  1
11  1818  1  12  1818.034  -1  1
12  1818  1  13  1818.037  22  1
13  1818  1  14  1818.040  -1  1
14  1818  1  15  1818.042  -1  1
15  1818  1  16  1818.045  -1  1
16  1818  1  17  1818.048  46  1
17  1818  1  18  1818.051  59  1
18  1818  1  19  1818.053  63  1
19  1818  1  20  1818.056  -1  1

### Using names keyword

In [82]:
col_names = ['year', 'month', 'day', 'dec_date', 'sunspots', 'definite']

col_names

['year', 'month', 'day', 'dec_date', 'sunspots', 'definite']

In [83]:
type(col_names)

list

In [84]:
sunspots = pd.read_csv(filepath, header=None, names=col_names)

sunspots

       year  month  day  dec_date  sunspots  definite
0      1818      1    1  1818.004        -1         1
1      1818      1    2  1818.007        -1         1
2      1818      1    3  1818.010        -1         1
3      1818      1    4  1818.012        -1         1
4      1818      1    5  1818.015        -1         1
...     ...    ...  ...       ...       ...       ...
71856  2014      9   26  2014.735       111         0
71857  2014      9   27  2014.738       122         0
71858  2014      9   28  2014.741       130         0
71859  2014      9   29  2014.743       121         0
71860  2014      9   30  2014.746       120         0

[71861 rows x 6 columns]

In [85]:
sunspots.iloc[10:20, :]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031        -1         1
11  1818      1   12  1818.034        -1         1
12  1818      1   13  1818.037        22         1
13  1818      1   14  1818.040        -1         1
14  1818      1   15  1818.042        -1         1
15  1818      1   16  1818.045        -1         1
16  1818      1   17  1818.048        46         1
17  1818      1   18  1818.051        59         1
18  1818      1   19  1818.053        63         1
19  1818      1   20  1818.056        -1         1

### Using na_values keyword (1)

- read_csv() 
    - <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html>

In [86]:
na_valuessunspots = pd.read_csv(filepath, header=None,
    ...:                        names=col_names, na_values='-1')

sunspots

       year  month  day  dec_date  sunspots  definite
0      1818      1    1  1818.004        -1         1
1      1818      1    2  1818.007        -1         1
2      1818      1    3  1818.010        -1         1
3      1818      1    4  1818.012        -1         1
4      1818      1    5  1818.015        -1         1
...     ...    ...  ...       ...       ...       ...
71856  2014      9   26  2014.735       111         0
71857  2014      9   27  2014.738       122         0
71858  2014      9   28  2014.741       130         0
71859  2014      9   29  2014.743       121         0
71860  2014      9   30  2014.746       120         0

[71861 rows x 6 columns]

In [87]:
sunspots.iloc[10:20, :]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031        -1         1
11  1818      1   12  1818.034        -1         1
12  1818      1   13  1818.037        22         1
13  1818      1   14  1818.040        -1         1
14  1818      1   15  1818.042        -1         1
15  1818      1   16  1818.045        -1         1
16  1818      1   17  1818.048        46         1
17  1818      1   18  1818.051        59         1
18  1818      1   19  1818.053        63         1
19  1818      1   20  1818.056        -1         1

In [89]:
#-- space in '-1' and ' -1'

sunspots = pd.read_csv(filepath, header=None,
                      names=col_names, na_values=' -1')

sunspots

       year  month  day  dec_date  sunspots  definite
0      1818      1    1  1818.004       NaN         1
1      1818      1    2  1818.007       NaN         1
2      1818      1    3  1818.010       NaN         1
3      1818      1    4  1818.012       NaN         1
4      1818      1    5  1818.015       NaN         1
...     ...    ...  ...       ...       ...       ...
71856  2014      9   26  2014.735     111.0         0
71857  2014      9   27  2014.738     122.0         0
71858  2014      9   28  2014.741     130.0         0
71859  2014      9   29  2014.743     121.0         0
71860  2014      9   30  2014.746     120.0         0

[71861 rows x 6 columns]

### Using na_values keyword (3)

In [90]:
sunspots = pd.read_csv(filepath, header=None,
    ...: names=col_names, na_values={'sunspots':[' -1']})

sunspots

       year  month  day  dec_date  sunspots  definite
0      1818      1    1  1818.004       NaN         1
1      1818      1    2  1818.007       NaN         1
2      1818      1    3  1818.010       NaN         1
3      1818      1    4  1818.012       NaN         1
4      1818      1    5  1818.015       NaN         1
...     ...    ...  ...       ...       ...       ...
71856  2014      9   26  2014.735     111.0         0
71857  2014      9   27  2014.738     122.0         0
71858  2014      9   28  2014.741     130.0         0
71859  2014      9   29  2014.743     121.0         0
71860  2014      9   30  2014.746     120.0         0

[71861 rows x 6 columns]

### Using parse_dates keyword

- read_csv() 
    - <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html>

In [92]:
sunspots = pd.read_csv(filepath, 
                       header=None,
                        names=col_names, na_values={'sunspots':[' -1']},
                        parse_dates=[[0, 1, 2]])

sunspots.iloc[10:20, :]

   year_month_day  dec_date  sunspots  definite
10     1818-01-11  1818.031       NaN         1
11     1818-01-12  1818.034       NaN         1
12     1818-01-13  1818.037      22.0         1
13     1818-01-14  1818.040       NaN         1
14     1818-01-15  1818.042       NaN         1
15     1818-01-16  1818.045       NaN         1
16     1818-01-17  1818.048      46.0         1
17     1818-01-18  1818.051      59.0         1
18     1818-01-19  1818.053      63.0         1
19     1818-01-20  1818.056       NaN         1

In [93]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71861 entries, 0 to 71860
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year_month_day  71861 non-null  datetime64[ns]
 1   dec_date        71861 non-null  float64
 2   sunspots        68614 non-null  float64
 3   definite        71861 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.2 MB

### Writing files

- to_csv()

    - <https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html>

In [94]:
sunspots.to_csv("data/ISSN_D_tot_CLEAN2.csv")